{
  "name": "Ryan Anthony Tulino",
  "title": "Senior Software Engineer",
  "email": "rtulino@gmail.com",
  "introduction": "A skilled professional with extensive knowledge of web technologies and a proven track record in developing thoughtfully designed software. With a passion for and breadth of experience in solving interesting problems, debugging performance concerns, automating deployments, and providing production support. My specialities include PHP, Ruby, and JavaScript with deep knowledge of SOLID/OOP principles and an eagerness to learn from and mentor other talented people.",
  "summary": [
    "Extensive background in ecommerce including payments and identity management.",
    "Good experience and knowledge of Agile, Scrum, code review, and pair programming.",
    "Highly knowledgable of Git and Gitflow.",
    "Experienced consuming and developing REST and SOAP APIs.",
    "Strong preference towards TDD and 100% “feature” coverage.",
    "Experience in deployment to both cloud and bare-metal infrastructure.",
    "Good at data modeling, database development, query optimization.",
    "Skilled in debugging, application support, system upgrades and performance.",
    "Good experience with writing technical documents, How-To’s and user guides.",
    "Planning test strategies, UATs, migration and production support.",
    "Good experience with various CICD platforms, Vagrant, and Docker."
  ],
  "certifications": [
    {
      "type": "Magento Certified Developer",
      "id": "y21dtt50b2",
      "date": "December 2013"
    },
    {
      "type": "Magento Certified Developer PLUS",
      "id": "31327995",
      "date": "April 2015"
    }
  ],
  "additional_links": [
    "https://www.linkedin.com/in/ryantulino/",
    "https://github.com/ryaan-anthony",
    "https://twitter.com/ryaan_anthony",
    "https://ryaan-anthony.github.io/profile/"
  ],
  "experience": [
    {
      "role": "Member of Technical Staff",
      "company": "Radial, Inc - ",
      "location": "King of Prussia, PA.",
      "start_date": "April 2016",
      "end_date": "Now",
      "projects": [
        {
          "title": "Project 1: Magento PTF",
          "homepage": "https://github.com/RadialCorp/magento-ptf-build",
          "description": "PTF is our payments, tax, and fraud offering for our client’s webstores. This initiative was to address the immediate need for a client's Magento webstore.",
          "responsibilities": [
            "Put together a small team of developers, QA testers, and managers to meet the tight deadlines.",
            "Provided credit card and paypal checkout options via our payment service API",
            "Used braintree client side encryption and tokenization.",
            "Connected to message brokering system for payments responses.",
            "Lead initial development through to deployment."
          ],
          "environment": "PHP5.6, Magento EE 1.14, Nginx, RHEL6, PHPUnit, Composer, Circle CI, RabbitMQ, jQuery, Github, Rally, Jira, Confluence"
        },
        {
          "title": "Project 2: Order Management UI",
          "homepage": "https://www.radial.com/omnichannel-technology",
          "description": "The Radial Order Management product provides a common user interface for customer sales representatives to manage webstore orders for leading retailers and brands.",
          "responsibilities": [
            "Reported directly to project managers who provided detailed business requirements.",
            "Met with designers and backend leads to architect solutions.",
            "Worked closely with a team of 6 developers to set delivery expectations.",
            "Created and groomed user stories for bi-weekly sprints.",
            "Implemented logstash/kibana for all API request/responses.",
            "Maintained above 90% code coverage for the added services.",
            "Interviewed candidates for senior-level rails developer role.",
            "Delivered on time despite losing a team member and on-boarding two non-rails developers.",
            "Organized team outings and lunches.",
            "Collaboratively designed and distributed valentines themed stickers with our product logo."
          ],
          "environment": "Ruby 2.3, Rails 4, Passenger 5, GOCD, Logstash, Kibana, Redis, MySQL, GitLab, Rally, Confluence"
        },
        {
          "title": "Project 3: Store Fulfillment UI",
          "homepage": "https://www.radial.com/fulfillment-transportation",
          "description": "The Radial Store Fulfillment product provides a common user interface for store associates to manage in-store pickup and ship to home orders.",
          "responsibilities": [
            "Joined architectural sessions for planning and discovery.",
            "Set delivery schedule and groomed the backlog to keep development moving despite blocked dependencies.",
            "Created services, generators, parsers, and tests.",
            "UAT support and production readiness including improved deployments and load testing.",
            "Actively participated in code review and peer coding.",
            "Advocated for process changes to improve productivity and maintain accountability.",
            "Regularly meet with sales and client services teams to discuss provisioning and integrations."
          ],
          "environment": "Ruby 2.3, Rails 4, Passenger 5, RHEL6, GOCD, Redis, MySQL, GitLab, Rally, Confluence"
        }
      ]
    },
    {
      "role": "Senior Software Engineer",
      "company": "eBay Enterprise - ",
      "location": "King of Prussia, PA.",
      "start_date": "July 2015",
      "end_date": "April 2016",
      "projects": [
        {
          "title": "Magento Extension Development",
          "homepage": "https://github.com/eBayEnterprise",
          "description": "As a senior member of the Cheetah team I developed and maintained Magento Extensions to support our OMS product offerings.",
          "responsibilities": [
            "Participated in daily stand-ups, demos, and planning sessions.",
            "Created classes and methods with extensibility and testability in mind.",
            "Engaged QA testers when acceptance criteria was not clear.",
            "Provided production support for operations team.",
            "Personally enabled several client webstore launches."
          ],
          "environment": "PHP5.6, Magento EE 1.14, Nginx, RHEL6, PHPUnit, Composer, Circle CI, RabbitMQ, jQuery, Github, Rally, Jira, Confluence"
        }
      ]
    },
    {
      "role": "Lead Magento Developer",
      "company": "Inverse Paradox, LLC - ",
      "location": "Penndel, PA.",
      "start_date": "April 2012",
      "end_date": "June 2015",
      "projects": [
        {
          "title": "Magento webstore development",
          "homepage": "https://www.inverseparadox.com/",
          "description": "With a client portfolio ranging from automotive and baked goods to jewelry and apparel, I helped enable this emerging web agency become a viable solutions provider for national/regional small/mid-market clients.",
          "responsibilities": [
            "Participated in the launch of over 20 Magento webstores",
            "Custom integrations including payments, CRM, CMS, ERP, PIM, etc.",
            "Advocated for process changes to improve project and task management.",
            "Advocated for and implemented version control and automated deployments.",
            "Participated in client discovery and review meetings.",
            "Helped establish best practices and launch procedures.",
            "Actively supported production clients.",
            "Mentored and peer-coded with junior developers and interns.",
            "Went to dozens of tech events and conferences while evangelizing the company brand.",
            "Locked several deals earning a nice commission from new client sales."
          ],
          "environment": "PHP5.5, CENTOS, Redis, Memcached, Magento CE 1.7-1.9, Magento EE 1.12-1.14, MySQL, Trello, Beanstalk"
        }
      ]
    },
    {
      "role": "Magento Consultant",
      "company": "",
      "location": "Philadelphia, PA.",
      "start_date": "January 2015",
      "end_date": "Now",
      "projects": [
        {
          "title": "Operations and Support",
          "description": "My client portfolio covers over 12 Magento Enterprise webstores.",
          "responsibilities": [
            "Attend discussions with developers, designers, integrators, and systems administrators.",
            "Provide stack analysis and implement best practices.",
            "Architect solutions for custom integrations and unique presentation requirements.",
            "Oversee and code review frontend development.",
            "Ensure 3rd party code is properly vetted.",
            "Optimize for peak."
          ],
          "environment": "PHP5.6, MySQL, RHEL6, Redis, Elasticsearch, Magento EE 1.13-1.14"
        }
      ]
    }
  ],
  "footnote": "This resume was generated by <a href=\"https://github.com/ryaan-anthony/profile\">https://github.com/ryaan-anthony/profile</a> in %sms!"
}
